cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF52xK.xml
        <!-- REGISTER "FRT_TCSB2" -->
        <register derivedFrom="FRT_TCSB0">
          <name>FRT_TCSB2</name>
          <description>FRT-ch.2 Control Register B</description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "FRT_TCCP0" -->
        <register>
          <name>FRT_TCCP0</name>
          <description>FRT-ch.0 Cycle Setting Register</description>
          <addressOffset>0x28</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "FRT_TCCP1" -->
        <register derivedFrom="FRT_TCCP0">
          <name>FRT_TCCP1</name>
          <description>FRT-ch.1 Cycle Setting Register</description>
          <addressOffset>0x38</addressOffset>
        </register>
        <!-- REGISTER "FRT_TCCP2" -->
        <register derivedFrom="FRT_TCCP0">
          <name>FRT_TCCP2</name>
          <description>FRT-ch.2 Cycle Setting Register</description>
          <addressOffset>0x48</addressOffset>
        </register>
        <!-- REGISTER "FRT_TCDT0" -->
        <register>
          <name>FRT_TCDT0</name>
          <description>FRT-ch.0 Count Value Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "FRT_TCDT1" -->
        <register derivedFrom="FRT_TCDT0">
          <name>FRT_TCDT1</name>
          <description>FRT-ch.1 Count Value Register</description>
          <addressOffset>0x3C</addressOffset>
        </register>
        <!-- REGISTER "FRT_TCDT2" -->
        <register derivedFrom="FRT_TCDT0">
          <name>FRT_TCDT2</name>
          <description>FRT-ch.2 Count Value Register</description>
          <addressOffset>0x4C</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCFS10" -->
        <register>
          <name>OCU_OCFS10</name>
          <description>"OCU ch.1,0 Connecting FRT Select Register"</description>
          <addressOffset>0x58</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSO0" -->
            <field>
              <name>FSO0</name>
              <description>Connects FRT ch.x to OCU ch.0</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSO1" -->
            <field>
              <name>FSO1</name>
              <description>Connects FRT ch.x to OCU ch.1</description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCFS32" -->
        <register derivedFrom="OCU_OCFS10">
          <name>OCU_OCFS32</name>
          <description>"OCU ch.3,2 Connecting FRT Select Register"</description>
          <addressOffset>0x59</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCFS54" -->
        <register derivedFrom="OCU_OCFS10">
          <name>OCU_OCFS54</name>
          <description>"OCU ch.5,4 Connecting FRT Select Register"</description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSA10" -->
        <register>
          <name>OCU_OCSA10</name>
          <description>"OCU ch.1,0 Control Register A"</description>
          <addressOffset>0x18</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0C</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CST0" -->
            <field>
              <name>CST0</name>
              <description>Enables the operation of OCU ch.(0)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CST1" -->
            <field>
              <name>CST1</name>
              <description>Enables the operation of OCU ch.(1)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDIS0" -->
            <field>
              <name>BDIS0</name>
              <description>Disables the buffer function of the OCCP(0) register</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BDIS1" -->
            <field>
              <name>BDIS1</name>
              <description>Disables the buffer function of the OCCP(1) register</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE0" -->
            <field>
              <name>IOE0</name>
              <description>"Generates interrupt, when ""1"" is set to OCSA.IOP0"</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOE1" -->
            <field>
              <name>IOE1</name>
              <description>"Generates interrupt, when ""1"" is set to OCSA.IOP1"</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOP0" -->
            <field>
              <name>IOP0</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(0) value at OCU ch.(0). </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IOP1" -->
            <field>
              <name>IOP1</name>
              <description>Indicates that a match has already been detected between FRT's count value and OCCP(1) value at OCU ch.(1).</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OCU_OCSA32" -->
        <register derivedFrom="OCU_OCSA10">
          <name>OCU_OCSA32</name>
          <description>"OCU ch.3,2 Control Register A"</description>
          <addressOffset>0x1C</addressOffset>
        </register>
        <!-- REGISTER "OCU_OCSA54" -->
        <register derivedFrom="OCU_OCSA10">
          <name>OCU_OCSA54</name>
          <description>"OCU ch.5,4 Control Register A"</description>
          <addressOffset>0x20</addressOffset>
        </register>
